RT-Thread-Studio/sdk-csp-gd32h7/libraries/GD32H75E_standard_peripheral/Include/gd32h75e_gpio.h
/* GPIO output speed values */
#define GPIO_OSPEED_SET(n, speed)  ((uint32_t)((uint32_t)(speed) << (2U * (n))))
#define GPIO_OSPEED_MASK(n)        (0x3U << (2U * (n)))

/* GPIO output type */
#define GPIO_OTYPE_PP              ((uint8_t)(0x00U))              /*!< push pull mode */
#define GPIO_OTYPE_OD              ((uint8_t)(0x01U))              /*!< open drain mode */

/* GPIO output max speed value */
#define OSPD_OSPD0(regval)         (BITS(0,1) & ((uint32_t)(regval) << 0))
#define GPIO_OSPEED_12MHZ           OSPD_OSPD0(0)                   /*!< output max speed 12MHz */
#define GPIO_OSPEED_60MHZ           OSPD_OSPD0(1)                   /*!< output max speed 60MHz */
#define GPIO_OSPEED_85MHZ           OSPD_OSPD0(2)                   /*!< output max speed 85MHz */
#define GPIO_OSPEED_100_220MHZ      OSPD_OSPD0(3)                   /*!< output max speed 100/220MHz */

/* GPIO input filter type values */
#define GPIO_IFTYPE_SET(n, type)   ((uint32_t)((uint32_t)(type) << (2U * (n))))
#define GPIO_IFTYPE_MASK(n)        (0x3U << (2U * (n)))

/* GPIO input filter sample period */
#define IFL_FLPRD0(regval)         (BITS(0,7) & ((uint32_t)(regval) << 0))
#define GPIO_ISPERIOD(vle)         IFL_FLPRD0(vle)                 /*!< input filter sample period */

/* GPIO input filtering type */
#define IFTYPE_IFTP0(regval)       (BITS(0,1) & ((uint32_t)(regval) << 0))
#define GPIO_IFTYPE_SYNC           IFTYPE_IFTP0(0)                 /*!< input filter type synchronization */
#define GPIO_IFTYPE_3_SAMPLE       IFTYPE_IFTP0(1)                 /*!< input filter type filter 3 samples */
#define GPIO_IFTYPE_6_SAMPLE       IFTYPE_IFTP0(2)                 /*!< input filter type filter 6 samples */
#define GPIO_IFTYPE_ASYNC          IFTYPE_IFTP0(3)                 /*!< input filter type asynchronous */

/* GPIO alternate function values */
#define GPIO_AFR_SET(n, af)        ((uint32_t)((uint32_t)(af) << (4U * (n))))
#define GPIO_AFR_MASK(n)           (0xFU << (4U * (n)))
 
/* GPIO alternate function */
#define AF(regval)                 (BITS(0,3) & ((uint32_t)(regval) << 0)) 
#define GPIO_AF_0                  AF(0)                           /*!< alternate function 0 selected */
#define GPIO_AF_1                  AF(1)                           /*!< alternate function 1 selected */
#define GPIO_AF_2                  AF(2)                           /*!< alternate function 2 selected */
#define GPIO_AF_3                  AF(3)                           /*!< alternate function 3 selected */
#define GPIO_AF_4                  AF(4)                           /*!< alternate function 4 selected */
#define GPIO_AF_5                  AF(5)                           /*!< alternate function 5 selected */
#define GPIO_AF_6                  AF(6)                           /*!< alternate function 6 selected */
#define GPIO_AF_7                  AF(7)                           /*!< alternate function 7 selected */
#define GPIO_AF_8                  AF(8)                           /*!< alternate function 8 selected */
#define GPIO_AF_9                  AF(9)                           /*!< alternate function 9 selected */
#define GPIO_AF_10                 AF(10)                          /*!< alternate function 10 selected */
#define GPIO_AF_11                 AF(11)                          /*!< alternate function 11 selected */
#define GPIO_AF_12                 AF(12)                          /*!< alternate function 12 selected */
#define GPIO_AF_13                 AF(13)                          /*!< alternate function 13 selected */
#define GPIO_AF_14                 AF(14)                          /*!< alternate function 14 selected */
#define GPIO_AF_15                 AF(15)                          /*!< alternate function 15 selected */

/* parameter check definitions */
#ifdef FW_DEBUG_ERR_REPORT
/* check peripherals */
#define NOT_GPIO_PERIPH(periph)                 (((periph) != GPIOA) && \
                                                 ((periph) != GPIOB) && \
                                                 ((periph) != GPIOC) && \
                                                 ((periph) != GPIOD) && \
                                                 ((periph) != GPIOE) && \
                                                 ((periph) != GPIOF) && \
                                                 ((periph) != GPIOG) && \
                                                 ((periph) != GPIOH) && \
                                                 ((periph) != GPIOJ) && \
                                                 ((periph) != GPIOK))

/* check GPIO pin modes */
#define NOT_GPIO_MODE(mode)                     (((mode) != GPIO_MODE_INPUT)  && \
                                                 ((mode) != GPIO_MODE_OUTPUT) && \
                                                 ((mode) != GPIO_MODE_AF) && \
                                                 ((mode) != GPIO_MODE_ANALOG))

/* check GPIO pin pull modes */
#define NOT_GPIO_PULL_MODE(pull_up_down)        (((pull_up_down) != GPIO_PUPD_NONE)   && \
                                                 ((pull_up_down) != GPIO_PUPD_PULLUP) && \
                                                 ((pull_up_down) != GPIO_PUPD_PULLDOWN))

/* check GPIO pin */
#define NOT_GPIO_PIN(pin)                       (((pin) == 0x00000000U) || ((pin) > 0x0000FFFFU))

/* check GPIO pin output mode */
#define NOT_GPIO_OTYPE(otype)                   (((otype) != GPIO_OTYPE_PP) && \
                                                 ((otype) != GPIO_OTYPE_OD))

/* check GPIO pin speed */
#define NOT_GPIO_SPEED(speed)                   (((speed) != GPIO_OSPEED_12MHZ) && \
                                                 ((speed) != GPIO_OSPEED_60MHZ) && \
                                                 ((speed) != GPIO_OSPEED_85MHZ) && \
                                                 ((speed) != GPIO_OSPEED_100_220MHZ))

/* check reset and set value */
#define NOT_RESET_SET(value)                    (((value) != RESET)  && \
                                                 ((value) != SET))

/* check GPIO pin AF */
#define NOT_GPIO_AF(alt_func_num)               (((alt_func_num) != GPIO_AF_0) && \
                                                 ((alt_func_num) != GPIO_AF_1) && \
                                                 ((alt_func_num) != GPIO_AF_2) && \
                                                 ((alt_func_num) != GPIO_AF_3) && \
                                                 ((alt_func_num) != GPIO_AF_4) && \
                                                 ((alt_func_num) != GPIO_AF_5) && \
                                                 ((alt_func_num) != GPIO_AF_6) && \
                                                 ((alt_func_num) != GPIO_AF_7) && \
                                                 ((alt_func_num) != GPIO_AF_8) && \
                                                 ((alt_func_num) != GPIO_AF_9) && \
                                                 ((alt_func_num) != GPIO_AF_10) && \
                                                 ((alt_func_num) != GPIO_AF_11) && \
                                                 ((alt_func_num) != GPIO_AF_12) && \
                                                 ((alt_func_num) != GPIO_AF_13) && \
                                                 ((alt_func_num) != GPIO_AF_14) && \
                                                 ((alt_func_num) != GPIO_AF_15))

